In [18]:
import pandas as pd
from sklearn.model_selection import train_test_split

In [26]:
data=pd.read_csv('carprices.csv')

In [28]:
data.head()

   Mileage  Age(yrs)  Sell Price($)
0    69000         6          18000
1    35000         3          34000
2    57000         5          26100
3    22500         2          40000
4    46000         4          31500

In [34]:
X=data[['Mileage','Age(yrs)']]

In [36]:
Y=data[['Sell Price($)']]

In [42]:
X_train,X_test,Y_train,Y_test=train_test_split(X,Y,test_size=.3)     #,random_state=3)

In [44]:
X_train

    Mileage  Age(yrs)
15    25400         3
14    82450         7
6     52000         5
0     69000         6
11    79000         7
3     22500         2
9     67000         6
8     91000         8
2     57000         5
18    87600         8
16    28000         2
17    69000         5
10    83000         7
5     59000         5